
#include "GeneralBaseComponent.hpp"


//********************************************************************************************
/**
 * コンストラクタ 
 *
 *   コンストラクタ 
 *
 * @return		なし
 */
//********************************************************************************************
GeneralBaseComponent::GeneralBaseComponent() :
	m_pParent(NULL_PTR)
{
}

//********************************************************************************************
/**
 * デストラクタ 
 *
 *   デストラクタ 
 *
 * @return		なし
 */
//********************************************************************************************
GeneralBaseComponent::~GeneralBaseComponent()
{
}

//********************************************************************************************
/**
* 親のポインタを登録 
*
*   親のポインタ(コンポーネントが生成されるクラスのポインタ)を登録 
*
* @param[in]	GeneralBaseClass* pParent	親のポインタ 
*
* @return		なし 
*/
//********************************************************************************************
void GeneralBaseComponent::SetParentPtr(GeneralBaseClass* pParent)
{
	ASSERT_IS_NOT_NULL(pParent);
	ASSERT_IS_NULL(m_pParent);

	m_pParent = pParent;
}

//********************************************************************************************
/**
* 親のポインタを取得 
*
*   親のポインタ(コンポーネントが生成されるクラスのポインタ)を取得 
*
* @return		GeneralBaseClass*	親のポインタ 
*/
//********************************************************************************************
GeneralBaseClass* GeneralBaseComponent::GetParentPtr()
{
	return m_pParent;
}



// EOF
